In [2]:
import numpy as np
import pandas as pd

pandas makes csv,xls,pdf,xml,json into 1 format called data frame<br>

In [3]:
import sys

In [31]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [10]:
df = pd.read_csv('datasets/info.csv')

In [13]:
#df
df.head(3)# without parameters will give 5 lines top

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [18]:
# for any specific columns
df_country = df["Country"]#for columns
df_unique=df["Country"].unique()# for unique

In [21]:
df.iloc[0:3,0] # to specify a particular rows and columns

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [23]:
 df.iloc[0:3,0:3] # remember every time last one is excluded duhh

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0

In [24]:
df.iloc[1:4,0:2]

   Country   Age
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0

In [29]:
df.iloc[[3,5],1:3].values # to remove headers and it will give in numpy array format

array([[3.8e+01, 6.1e+04],
       [3.5e+01, 5.8e+04]])

In [32]:
df['Age'].max() # can use min mean and average

50.0

In [34]:
[i for i in dir(pd) if 'read' in i]

['read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table']